apache/nuttx/arch/arm/src/common/stm32/stm32_eth_m3m4_v1.c
      /* Initialize the next descriptor with
       * the Next Descriptor Polling Enable
       */

      if (i < (CONFIG_STM32_ETH_NRXDESC - 1))
        {
          /* Set next descriptor address register with next descriptor base
           * address
           */

          rxdesc->rdes3 = (uint32_t)&rxtable[i + 1];
        }
      else
        {
          /* For last descriptor, set next descriptor address register equal
           * to the first descriptor base address
           */

          rxdesc->rdes3 = (uint32_t)rxtable;
        }
    }

  /* Set Receive Descriptor List Address Register */

  stm32_putreg((uint32_t)rxtable, STM32_ETH_DMARDLAR);
}

/****************************************************************************
 * Function: stm32_ioctl
 *
 * Description:
 *  Executes the SIOCxMIIxxx command and responds using the request struct
 *  that must be provided as its 2nd parameter.
 *
 *  When called with SIOCGMIIPHY it will get the PHY address for the device
 *  and write it to the req->phy_id field of the request struct.
 *
 *  When called with SIOCGMIIREG it will read a register of the PHY that is
 *  specified using the req->reg_no struct field and then write its output
 *  to the req->val_out field.
 *
 *  When called with SIOCSMIIREG it will write to a register of the PHY that
 *  is specified using the req->reg_no struct field and use req->val_in as
 *  its input.
 *
 * Input Parameters:
 *   dev - Ethernet device structure
 *   cmd - SIOCxMIIxxx command code
 *   arg - Request structure also used to return values
 *
 * Returned Value: Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

#ifdef CONFIG_NETDEV_IOCTL
static int stm32_ioctl(struct net_driver_s *dev, int cmd, unsigned long arg)
{
#if (defined(CONFIG_NETDEV_PHY_IOCTL) && defined(CONFIG_ARCH_PHY_INTERRUPT)) || \
    defined(CONFIG_STM32_ETH_TIMESTAMP_TX)
  struct stm32_ethmac_s *priv =
    (struct stm32_ethmac_s *)dev->d_private;
#endif
  int ret;

  switch (cmd)
    {
#ifdef CONFIG_NETDEV_PHY_IOCTL
#ifdef CONFIG_ARCH_PHY_INTERRUPT
      case SIOCMIINOTIFY: /* Set up for PHY event notifications */
        {
          struct mii_ioctl_notify_s *req =
        (struct mii_ioctl_notify_s *)((uintptr_t)arg);

          ret = phy_notify_subscribe(dev->d_ifname, req->pid, &req->event);
          if (ret == OK)
            {
              /* Enable PHY link up/down interrupts */

              ret = stm32_phyintenable(priv);
            }
        }
        break;
#endif

      case SIOCGMIIPHY: /* Get MII PHY address */
        {
          struct mii_ioctl_data_s *req =
        (struct mii_ioctl_data_s *)((uintptr_t)arg);

          req->phy_id = CONFIG_STM32_PHYADDR;
          ret = OK;
        }
        break;

      case SIOCGMIIREG: /* Get register from MII PHY */
        {
          struct mii_ioctl_data_s *req =
        (struct mii_ioctl_data_s *)((uintptr_t)arg);

          ret = stm32_phyread(req->phy_id, req->reg_num, &req->val_out);
        }
        break;

      case SIOCSMIIREG: /* Set register in MII PHY */
        {
          struct mii_ioctl_data_s *req =
        (struct mii_ioctl_data_s *)((uintptr_t)arg);

          ret = stm32_phywrite(req->phy_id, req->reg_num, req->val_in);
        }
        break;
#endif /* CONFIG_NETDEV_PHY_IOCTL */

#ifdef CONFIG_STM32_ETH_TIMESTAMP_TX
      case SIOCG_TX_HW_TIMESTAMP:
        {
          FAR struct timespec *ts = (FAR struct timespec *)((uintptr_t)arg);

          _alert("IOCTL SIOCG_TX_HW_TIMESTAMP: waiting for sem...\n");

          if (ts == NULL)
            {
              ret = -EINVAL;
              break;
            }

          /* Wait for TX done interrupt to capture timestamp.
           * Timeout after 50 ms.
           */

          ret = nxsem_tickwait_uninterruptible(&priv->tx_ptp_sem,
                                               MSEC2TICK(50));
          if (ret < 0)
            {
              nerr("Timed out waiting for TX hardware timestamp: %d\n", ret);
              ret = -ETIMEDOUT;
              break;
            }

          if (!priv->tx_last_valid)
            {
              nerr("TX hardware timestamp not available\n");
              ret = -ENODATA;
              break;
            }

          *ts = priv->tx_last_ts;
          priv->tx_last_valid = false;
          ret = OK;
        }
        break;
#endif
#ifdef CONFIG_STM32_ETH_PTP
      case SIOCS_PTP_ADJFREQ:
        {
          FAR const long *ppb = (FAR const long *)((uintptr_t)arg);

          if (ppb == NULL)
            {
              ret = -EINVAL;
              break;
            }

          ret = stm32_eth_ptp_adjust(*ppb);
        }
        break;

      case SIOCS_PTP_ADJPHASE:
        {
          FAR const int64_t *delta_ns =
            (FAR const int64_t *)((uintptr_t)arg);

          if (delta_ns == NULL)
            {
              ret = -EINVAL;
              break;
            }

          ret = stm32_eth_ptp_adjphase(*delta_ns);
        }
        break;
#endif

      default:
        ret = -ENOTTY;
        break;
    }

  return ret;
}
#endif /* CONFIG_NETDEV_IOCTL */

/****************************************************************************
 * Function: stm32_phyintenable
 *
 * Description:
 *  Enable link up/down PHY interrupts.  The interrupt protocol is like this:
 *
 *  - Interrupt status is cleared when the interrupt is enabled.
 *  - Interrupt occurs.  Interrupt is disabled (at the processor level) when
 *    is received.
 *  - Interrupt status is cleared when the interrupt is re-enabled.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno (-ETIMEDOUT) on failure.
 *
 ****************************************************************************/

#if defined(CONFIG_NETDEV_PHY_IOCTL) && defined(CONFIG_ARCH_PHY_INTERRUPT)
static int stm32_phyintenable(struct stm32_ethmac_s *priv)
{
  uint16_t phyval;
  int ret;

  ret = stm32_phyread(CONFIG_STM32_PHYADDR, MII_INT_REG, &phyval);
  if (ret == OK)
    {
      /* Enable link up/down interrupts */

