apache/nuttx/arch/arm/src/common/stm32/stm32_eth_m3m4_v1.c
  /* MDC and MDIO are common to both modes */

  stm32_configgpio(GPIO_ETH_MDC);
  stm32_configgpio(GPIO_ETH_MDIO);

  /* Set up the MII interface */

#  if defined(CONFIG_STM32_MII)

  /* Select the MII interface */

  stm32_selectmii();

  /* Provide clocking via MCO, MCO1 or MCO2:
   *
   * "MCO1 (microcontroller clock output), used to output HSI, LSE, HSE or
   *  PLL clock (through a configurable prescaler) on PA8 pin."
   *
   * "MCO2 (microcontroller clock output), used to output HSE, PLL, SYSCLK or
   *  PLLI2S clock (through a configurable prescaler) on PC9 pin."
   */

#    if defined(CONFIG_STM32_MII_MCO1)
  /* Configure MC01 to drive the PHY.  Board logic must provide MC01 clocking
   * info.
   */

  stm32_configgpio(GPIO_MCO1);
  stm32_mco1config(BOARD_CFGR_MC01_SOURCE, BOARD_CFGR_MC01_DIVIDER);

#    elif defined(CONFIG_STM32_MII_MCO2)
  /* Configure MC02 to drive the PHY.  Board logic must provide MC02 clocking
   * info.
   */

  stm32_configgpio(GPIO_MCO2);
  stm32_mco2config(BOARD_CFGR_MC02_SOURCE, BOARD_CFGR_MC02_DIVIDER);

#    elif defined(CONFIG_STM32_MII_MCO)
  /* Setup MCO pin for alternative usage */

  stm32_configgpio(GPIO_MCO);
  stm32_mcoconfig(BOARD_CFGR_MCO_SOURCE);
#    endif

  /* MII interface pins (17):
   *
   * MII_TX_CLK, MII_TXD[3:0], MII_TX_EN, MII_RX_CLK, MII_RXD[3:0],
   * MII_RX_ER, MII_RX_DV, MII_CRS, MII_COL, MDC, MDIO
   */

  stm32_configgpio(GPIO_ETH_MII_COL);
  stm32_configgpio(GPIO_ETH_MII_CRS);
  stm32_configgpio(GPIO_ETH_MII_RXD0);
  stm32_configgpio(GPIO_ETH_MII_RXD1);
  stm32_configgpio(GPIO_ETH_MII_RXD2);
  stm32_configgpio(GPIO_ETH_MII_RXD3);
  stm32_configgpio(GPIO_ETH_MII_RX_CLK);
  stm32_configgpio(GPIO_ETH_MII_RX_DV);
  stm32_configgpio(GPIO_ETH_MII_RX_ER);
  stm32_configgpio(GPIO_ETH_MII_TXD0);
  stm32_configgpio(GPIO_ETH_MII_TXD1);
  stm32_configgpio(GPIO_ETH_MII_TXD2);
  stm32_configgpio(GPIO_ETH_MII_TXD3);
  stm32_configgpio(GPIO_ETH_MII_TX_CLK);
  stm32_configgpio(GPIO_ETH_MII_TX_EN);

  /* Set up the RMII interface. */

#  elif defined(CONFIG_STM32_RMII)

  /* Select the RMII interface */

  stm32_selectrmii();

  /* Provide clocking via MCO, MCO1 or MCO2:
   *
   * "MCO1 (microcontroller clock output), used to output HSI, LSE, HSE or
   *  PLL clock (through a configurable prescaler) on PA8 pin."
   *
   * "MCO2 (microcontroller clock output), used to output HSE, PLL, SYSCLK or
   *  PLLI2S clock (through a configurable prescaler) on PC9 pin."
   */

#    if defined(CONFIG_STM32_RMII_MCO1)
  /* Configure MC01 to drive the PHY.  Board logic must provide MC01 clocking
   * info.
   */

  stm32_configgpio(GPIO_MCO1);
  stm32_mco1config(BOARD_CFGR_MC01_SOURCE, BOARD_CFGR_MC01_DIVIDER);

#    elif defined(CONFIG_STM32_RMII_MCO2)
  /* Configure MC02 to drive the PHY.  Board logic must provide MC02 clocking
   * info.
   */

  stm32_configgpio(GPIO_MCO2);
  stm32_mco2config(BOARD_CFGR_MC02_SOURCE, BOARD_CFGR_MC02_DIVIDER);

#    elif defined(CONFIG_STM32_RMII_MCO)
  /* Setup MCO pin for alternative usage */

  stm32_configgpio(GPIO_MCO);
  stm32_mcoconfig(BOARD_CFGR_MCO_SOURCE);
#    endif

  /* RMII interface pins (7):
   *
   * RMII_TXD[1:0], RMII_TX_EN, RMII_RXD[1:0], RMII_CRS_DV, MDC, MDIO,
   * RMII_REF_CLK
   */

  stm32_configgpio(GPIO_ETH_RMII_CRS_DV);
  stm32_configgpio(GPIO_ETH_RMII_REF_CLK);
  stm32_configgpio(GPIO_ETH_RMII_RXD0);
  stm32_configgpio(GPIO_ETH_RMII_RXD1);
  stm32_configgpio(GPIO_ETH_RMII_TXD0);
  stm32_configgpio(GPIO_ETH_RMII_TXD1);
  stm32_configgpio(GPIO_ETH_RMII_TX_EN);

#  endif
#endif

#ifdef CONFIG_STM32_ETH_PTP_GPIO
  /* Enable pulse-per-second (PPS) output signal */

  stm32_configgpio(GPIO_ETH_PPS_OUT);
#endif
}

#ifdef CONFIG_STM32_ETH_PTP

/****************************************************************************
 * Function: stm32_eth_ptp_adjust
 *
 * Description:
 *   Adjust PTP timer run rate.
 *
 * Input Parameters:
 *   ppb - Adjustment in parts per billion (nanoseconds per second).
 *         Zero is default rate, positive value makes clock run faster
 *         and negative value slower.
 *
 * Returned Value:
 *   OK on success, negated errno on failure.
 *
 * Assumptions:
 *   Adjustment is between -0.5e9 and +0.5e9 (+- 50%)
 *
 ****************************************************************************/

static int stm32_eth_ptp_adjust(long ppb)
{
  uint32_t regval;
  int64_t addend;
  uint32_t increment;

  /* Compute addend value to achieve nominal timer rate.
   * Increment is set by stm32_eth_ptp_init() and remains constants after
   * that.
   */

  increment = stm32_getreg(STM32_ETH_PTPSSIR) & ETH_PTPSSIR_MASK;
  addend = ((uint64_t)1 << (32 + 31)) / (STM32_SYSCLK_FREQUENCY * increment);

  /* Apply rate adjustment, if any */

  if (ppb != 0)
    {
      addend += addend * (int64_t)ppb / NSEC_PER_SEC;
    }

  /* Check for overflows */

  if (addend <= 0 || (uint64_t)addend > UINT32_MAX)
    {
      nerr("PTP adjustment out of range: ppb=%ld, addend=%lld\n",
           ppb, (long long)addend);
      return -EINVAL;
    }

  /* Perform addend register update */

  stm32_putreg((uint32_t)addend, STM32_ETH_PTPTSAR);
  regval = stm32_getreg(STM32_ETH_PTPTSCR);
  stm32_putreg(regval | ETH_PTPTSCR_TSARU, STM32_ETH_PTPTSCR);
  up_udelay(1);
  if (stm32_getreg(STM32_ETH_PTPTSCR) & ETH_PTPTSCR_TSARU)
    {
      /* This can happen if Ethernet PHY clock is stopped */

      nerr("PTP addend update failed\n");
      return -EBUSY;
    }

  return OK;
}

/****************************************************************************
 * Function: stm32_eth_ptp_adjphase
 *
 * Description:
 *   Nudge the PTP hardware counter's phase by a signed delta, in
 *   nanoseconds, via the System Time Update (TSSTU) mechanism. Unlike
 *   stm32_eth_ptp_init(), this does not reset the rate (addend) that
 *   stm32_eth_ptp_adjust() may already have applied.
 *
 * Input Parameters:
 *   delta_ns - Amount to add to (positive) or subtract from (negative)
 *              the current counter value.
 *
 * Returned Value:
 *   OK on success, negated errno on failure.
 *
 ****************************************************************************/

static int stm32_eth_ptp_adjphase(int64_t delta_ns)
{
  uint32_t regval;
  uint32_t sec;
  uint32_t subsec;
  uint32_t abs_nsec;
  uint64_t abs_ns;
  bool negative;

  negative = (delta_ns < 0);
  abs_ns   = negative ? (uint64_t)(-delta_ns) : (uint64_t)delta_ns;

  sec      = (uint32_t)(abs_ns / NSEC_PER_SEC);
  abs_nsec = (uint32_t)(abs_ns % NSEC_PER_SEC);

  /* Convert the nanosecond remainder to the same 32-bit binary fraction
   * of a second used by ptp_to_timespec()/stm32_eth_ptp_init(), then
   * halve it to fit the 31-bit TSUSS field (mirrors the >>1 done in
   * stm32_eth_ptp_init()).
   */

  subsec = (uint32_t)(((uint64_t)abs_nsec << 32) / NSEC_PER_SEC) >> 1;
  subsec &= ETH_PTPTSLR_MASK;

