apache/nuttx/arch/arm/src/common/stm32/stm32_eth_m3m4_v1.c
  stm32_putreg(sec, STM32_ETH_PTPTSHUR);
  stm32_putreg(subsec | (negative ? ETH_PTPTSLU_TSUPNS : 0),
              STM32_ETH_PTPTSLUR);

  regval = stm32_getreg(STM32_ETH_PTPTSCR);
  stm32_putreg(regval | ETH_PTPTSCR_TSSTU, STM32_ETH_PTPTSCR);
  up_udelay(1);
  if (stm32_getreg(STM32_ETH_PTPTSCR) & ETH_PTPTSCR_TSSTU)
    {
      nerr("PTP phase update failed\n");
      return -EBUSY;
    }

  return OK;
}

/****************************************************************************
 * Function: stm32_eth_ptp_init
 *
 * Description:
 *   Configure the PTP timestamp counter of the Ethernet peripheral.
 *
 * Input Parameters:
 *   timestamp: Initial timestamp
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static void stm32_eth_ptp_init(uint64_t timestamp)
{
  uint32_t regval;
  uint32_t increment;

  /* The PPS timestamp counter consists of a 32-bit seconds counter and
   * 31-bit subsecond counter. The PTP input clock (SYSCLK) is divided by
   * 2^32 / ADDEND and multiplied by INCREMENT. This calculation aims for
   * ADDEND of 2^31 to provide +- 50% rate adjustment range.
   *
   * ADDEND value is then adjusted to compensate for rounding errors in
   * the 8-bit INCREMENT value. The final rounding error will be less than
   * 1 ppb. The timer frequency is approximately half of SYSCLK frequency,
   * with phase jitter of one SYSCLK period.
   */

  increment = ((uint32_t)1 << 31) / (STM32_SYSCLK_FREQUENCY / 2);
  DEBUGASSERT(increment > 0 && (increment & ETH_PTPSSIR_MASK) == increment);

  /* Timestamp counter initialization process
   * (STM32F407 reference manual section 33.5.9
   *  "Programming steps for system time generation initialization")
   */

  regval = ETH_PTPTSCR_TSE;
  stm32_putreg(regval, STM32_ETH_PTPTSCR);
  stm32_putreg(increment, STM32_ETH_PTPSSIR);

  /* Update addend value to default rate */

  stm32_eth_ptp_adjust(0);

  /* Enable fine update mode */

  regval |= ETH_PTPTSCR_TSFCU;
  stm32_putreg(regval, STM32_ETH_PTPTSCR);

  /* Initialize counter value */

  stm32_putreg((uint32_t)(timestamp >> 32), STM32_ETH_PTPTSHUR);
  stm32_putreg((uint32_t)(timestamp >> 1), STM32_ETH_PTPTSLUR);
  stm32_putreg(regval | ETH_PTPTSCR_TSSTI, STM32_ETH_PTPTSCR);
  up_udelay(1);

  /* Initialization should complete within a few clock cycles.
   * If not, there is probably something wrong with the PHY clock domain.
   */

  if (stm32_getreg(STM32_ETH_PTPTSCR) & ETH_PTPTSCR_TSSTI)
    {
      nerr("PTP timestamp initialization failed\n");
    }

  /* Enable packet timestamping */

#ifdef CONFIG_STM32_ETH_TIMESTAMP_RX
  regval |= ETH_PTPTSCR_TSSARFE;
  stm32_putreg(regval, STM32_ETH_PTPTSCR);
#endif
}

/****************************************************************************
 * Name: stm32_eth_ptp_gettime
 *
 * Description:
 *   Read PTP timestamp registers. The 64-bit timestamp consists of two
 *   registers that are updated continuously. This function employs
 *   double-read pattern to correctly handle overflow of the lower register.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   64-bit timestamp, where upper 32 bits are the second count and lower
 *   32-bits are the subsecond count.
 *   If timer is not yet initialized, returns 0.
 *
 * Assumptions:
 *   Can be called from interrupt or task context.
 *
 ****************************************************************************/

#ifdef CONFIG_STM32_ETH_PTP_RTC_HIRES
static uint64_t stm32_eth_ptp_gettime(void)
{
  uint32_t high1;
  uint32_t low;
  uint32_t high2;

  high1 = getreg32(STM32_ETH_PTPTSHR);
  low = getreg32(STM32_ETH_PTPTSLR);
  high2 = getreg32(STM32_ETH_PTPTSHR);

  if (high1 == high2)
    {
      return ((uint64_t)high2 << 32) | ((low & ETH_PTPTSLR_MASK) << 1);
    }
  else
    {
      /* Lower counter overflowed between the two register reads.
       * Take its value as 0.
       */

      return ((uint64_t)high2 << 32);
    }
}
#endif

static inline void ptp_to_timespec(uint64_t timestamp, struct timespec *ts)
{
  ts->tv_sec = (timestamp >> 32);
  ts->tv_nsec = ((uint32_t)timestamp * (uint64_t)NSEC_PER_SEC) >> 32;
}

#if defined(CONFIG_STM32_ETH_TIMESTAMP_RX) || defined(CONFIG_STM32_ETH_TIMESTAMP_TX)
/****************************************************************************
 * Name: stm32_eth_ptp_convert_hwtime
 *
 * Description:
 *   Convert 64-bit hardware timestamp (seconds and subseconds) to
 *   CLOCK_REALTIME.
 *
 ****************************************************************************/

static int stm32_eth_ptp_convert_hwtime(uint32_t sec, uint32_t subsecond,
                                        FAR struct timespec *ts)
{
  uint64_t timestamp;

  timestamp = ((uint64_t)sec << 32)
            | ((subsecond & ETH_PTPTSLR_MASK) << 1);

  /* Timestamp of 0 indicates that Ethernet peripheral didn't store the
   * timestamp. Timestamp of all ones indicates "corrupt timestamp"
   * according to reference manual. In either case, return error.
   */

  if (timestamp == 0 || timestamp >= UINT64_MAX - 1)
    {
      ts->tv_sec = 0;
      ts->tv_nsec = 0;
      return -EINVAL;
    }

  /* Convert 64-bit hardware timestamp directly into timespec.
   * In a PTP system, the MAC hardware counter is the PTP clock reference.
   * Delivering the hardware counter's timestamp directly allows the PTP
   * daemon to close the feedback loop and phase-lock the MAC counter (and
   * therefore the physical PPS output) to the master.
   */

  ptp_to_timespec(timestamp, ts);
  return OK;
}
#endif /* CONFIG_STM32_ETH_TIMESTAMP_RX || CONFIG_STM32_ETH_TIMESTAMP_TX */

/* Convert RX timestamp to CLOCK_REALTIME */

#ifdef CONFIG_STM32_ETH_TIMESTAMP_RX
static void stm32_eth_ptp_convert_rxtime(struct stm32_ethmac_s *priv)
{
  if (stm32_eth_ptp_convert_hwtime(priv->rxtimehigh, priv->rxtimelow,
                                   &priv->dev.d_rxtime) < 0)
    {
      nerr("Packet RX timestamp is invalid\n");
    }
}
#endif /* CONFIG_STM32_ETH_TIMESTAMP_RX */

#ifdef CONFIG_STM32_ETH_TIMESTAMP_TX
/****************************************************************************
 * Name: stm32_is_ptp_event_frame
 *
 * Description:
 *   Inspect Ethernet frame to determine if it is a PTP event message
 *   (Sync, Delay_Req, Pdelay_Req, Pdelay_Resp) requiring TX timestamping.
 *
 ****************************************************************************/

