apache/nuttx/arch/arm/src/common/stm32/stm32_eth_m3m4_v1.c
static bool stm32_is_ptp_event_frame(FAR const uint8_t *buf, uint16_t len)
{
  uint16_t ethertype;

  if (buf == NULL || len < 14)
    {
      return false;
    }

  ethertype = (buf[12] << 8) | buf[13];

  /* 802.1Q VLAN tag support */

  if (ethertype == 0x8100 && len >= 18)
    {
      ethertype = (buf[16] << 8) | buf[17];
      buf += 4;
      len -= 4;
    }

  /* PTP over IEEE 802.3 / Ethernet (EtherType 0x88F7) */

  if (ethertype == 0x88f7)
    {
      if (len >= 15)
        {
          uint8_t msgtype = buf[14] & 0x0f;

          /* Event messages: Sync(0), Delay_Req(1), Pdelay_Req(2),
           * Pdelay_Resp(3).
           */

          if (msgtype <= 3)
            {
              return true;
            }
        }

      return false;
    }

  /* PTP over UDP/IPv4 (EtherType 0x0800) */

  if (ethertype == 0x0800 && len >= 14 + 20 + 8)
    {
      FAR const uint8_t *ip = &buf[14];
      uint8_t ip_hl = (ip[0] & 0x0f) * 4;
      uint8_t ip_proto = ip[9];

      if (ip_proto == 17 && len >= 14 + ip_hl + 8) /* UDP */
        {
          FAR const uint8_t *udp = &buf[14 + ip_hl];
          uint16_t dst_port = (udp[2] << 8) | udp[3];

          /* PTP event messages use UDP port 319 */

          if (dst_port == 319)
            {
              if (len >= 14 + ip_hl + 8 + 1)
                {
                  FAR const uint8_t *ptp = &udp[8];
                  uint8_t msgtype = ptp[0] & 0x0f;

                  if (msgtype <= 3)
                    {
                      return true;
                    }
                }
            }
        }
    }

  return false;
}
#endif /* CONFIG_STM32_ETH_TIMESTAMP_TX */

#endif /* CONFIG_STM32_ETH_PTP */

/****************************************************************************
 * Function: stm32_ethreset
 *
 * Description:
 *  Reset the Ethernet block.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   Zero on success, or a negated errno value on any failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int stm32_ethreset(struct stm32_ethmac_s *priv)
{
  uint32_t regval;
  uint32_t retries;

  /* Reset the Ethernet on the AHB bus (F1 Connectivity Line) or AHB1 bus (F2
   * and F4)
   */

#if defined(CONFIG_STM32_CONNECTIVITYLINE)
  regval  = stm32_getreg(STM32_RCC_AHBRSTR);
  regval |= RCC_AHBRSTR_ETHMACRST;
  stm32_putreg(regval, STM32_RCC_AHBRSTR);

  regval &= ~RCC_AHBRSTR_ETHMACRST;
  stm32_putreg(regval, STM32_RCC_AHBRSTR);
#else
  regval  = stm32_getreg(STM32_RCC_AHB1RSTR);
  regval |= RCC_AHB1RSTR_ETHMACRST;
  stm32_putreg(regval, STM32_RCC_AHB1RSTR);

  regval &= ~RCC_AHB1RSTR_ETHMACRST;
  stm32_putreg(regval, STM32_RCC_AHB1RSTR);
#endif

  /* Perform a software reset by setting the SR bit in the DMABMR register.
   * This Resets all MAC subsystem internal registers and logic.  After this
   * reset all the registers holds their reset values.
   */

  regval  = stm32_getreg(STM32_ETH_DMABMR);
  regval |= ETH_DMABMR_SR;
  stm32_putreg(regval, STM32_ETH_DMABMR);

  /* Wait for software reset to complete. The SR bit is cleared automatically
   * after the reset operation has completed in all core clock domains.
   * Should take at most a few clock ticks of the 50 MHz domain.
   */

  retries = 10;
  while (((stm32_getreg(STM32_ETH_DMABMR) & ETH_DMABMR_SR) != 0) &&
         retries > 0)
    {
      retries--;
      up_udelay(1);
    }

  if (retries == 0)
    {
      return -ETIMEDOUT;
    }

  return 0;
}

/****************************************************************************
 * Function: stm32_macconfig
 *
 * Description:
 *  Configure the Ethernet MAC for DMA operation.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int stm32_macconfig(struct stm32_ethmac_s *priv)
{
  uint32_t regval;

  /* Set up the MACCR register */

  regval  = stm32_getreg(STM32_ETH_MACCR);
  regval &= ~MACCR_CLEAR_BITS;
  regval |= MACCR_SET_BITS;

  /* Disable reception of our own transmitted frames. In half-duplex
   * mode the MAC otherwise reflects every frame it transmits back to
   * its own receiver (this bit has no effect in full-duplex, so it is
   * safe to set unconditionally). Without it, a busy transmitter can
   * flood the receive path with its own traffic right as a genuine
   * reply arrives.
   */

  regval |= ETH_MACCR_ROD;

  if (priv->fduplex)
    {
      /* Set the DM bit for full duplex support */

      regval |= ETH_MACCR_DM;
    }

  if (priv->mbps100)
    {
      /* Set the FES bit for 100Mbps fast ethernet support */

      regval |= ETH_MACCR_FES;
    }

  stm32_putreg(regval, STM32_ETH_MACCR);

  /* Set up the MACFFR register */

  regval  = stm32_getreg(STM32_ETH_MACFFR);
  regval &= ~MACFFR_CLEAR_BITS;
  regval |= MACFFR_SET_BITS;
  stm32_putreg(regval, STM32_ETH_MACFFR);

  /* Set up the MACHTHR and MACHTLR registers */

  stm32_putreg(0, STM32_ETH_MACHTHR);
  stm32_putreg(0, STM32_ETH_MACHTLR);

  /* Setup up the MACFCR register */

  regval  = stm32_getreg(STM32_ETH_MACFCR);
  regval &= ~MACFCR_CLEAR_MASK;
  regval |= MACFCR_SET_MASK;
  stm32_putreg(regval, STM32_ETH_MACFCR);

  /* Setup up the MACVLANTR register */

  stm32_putreg(0, STM32_ETH_MACVLANTR);

  /* DMA Configuration */

  /* Set up the DMAOMR register */

  regval  = stm32_getreg(STM32_ETH_DMAOMR);
  regval &= ~DMAOMR_CLEAR_MASK;
  regval |= DMAOMR_SET_MASK;
  stm32_putreg(regval, STM32_ETH_DMAOMR);

  /* Set up the DMABMR register */

  regval  = stm32_getreg(STM32_ETH_DMABMR);
  regval &= ~DMABMR_CLEAR_MASK;
  regval |= DMABMR_SET_MASK;
  stm32_putreg(regval, STM32_ETH_DMABMR);

  return OK;
}

/****************************************************************************
 * Function: stm32_macaddress
 *
 * Description:
 *   Configure the selected MAC address.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static void stm32_macaddress(struct stm32_ethmac_s *priv)
{
  struct net_driver_s *dev = &priv->dev;
  uint32_t regval;

  ninfo("%s MAC: %02x:%02x:%02x:%02x:%02x:%02x\n",
        dev->d_ifname,
        dev->d_mac.ether.ether_addr_octet[0],
        dev->d_mac.ether.ether_addr_octet[1],
        dev->d_mac.ether.ether_addr_octet[2],
        dev->d_mac.ether.ether_addr_octet[3],
        dev->d_mac.ether.ether_addr_octet[4],
        dev->d_mac.ether.ether_addr_octet[5]);

  /* Set the MAC address high register */

