apache/nuttx/arch/arm/src/common/stm32/stm32_eth_m3m4_v1.c
  /* Configure GPIO pins to support Ethernet */

  stm32_ethgpioconfig(priv);

  /* Attach the IRQ to the driver */

  if (irq_attach(STM32_IRQ_ETH, stm32_interrupt, NULL))
    {
      /* We could not attach the ISR to the interrupt */

      return -EAGAIN;
    }

  /* Put the interface in the down state. */

  ret = stm32_ifdown(&priv->dev);
  if (ret < 0)
    {
      nerr("ERROR: Initialization of Ethernet block failed: %d\n", ret);
      return ret;
    }

  /* Register the device with the OS so that socket IOCTLs can be performed */

  netdev_register(&priv->dev, NET_LL_ETHERNET);
  return OK;
}

/****************************************************************************
 * Function: arm_netinitialize
 *
 * Description:
 *   This is the "standard" network initialization logic called from the
 *   low-level initialization logic in arm_initialize.c.  If STM32_NETHERNET
 *   greater than one, then board specific logic will have to supply a
 *   version of arm_netinitialize() that calls stm32_ethinitialize() with
 *   the appropriate interface number.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 * Assumptions:
 *
 ****************************************************************************/

#if STM32_NETHERNET == 1 && !defined(CONFIG_NETDEV_LATEINIT)
void arm_netinitialize(void)
{
  stm32_ethinitialize(0);
}
#endif

#ifdef CONFIG_STM32_ETH_PTP_RTC_HIRES

/****************************************************************************
 * Name: up_rtc_initialize
 *
 * Description:
 *   Initialize the builtin, MCU hardware RTC per the selected
 *   configuration.  This function is called once very early in the OS
 *   initialization sequence.
 *
 *   NOTE that initialization of external RTC hardware that depends on the
 *   availability of OS resources (such as SPI or I2C) must be deferred
 *   until the system has fully booted.  Other, RTC-specific initialization
 *   functions are used in that case.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno on failure
 *
 ****************************************************************************/

int up_rtc_initialize(void)
{
  /* Nothing to do, the PTP RTC is not available until Ethernet peripheral
   * is enabled.
   */

  return OK;
}

/****************************************************************************
 * Name: up_rtc_gettime
 *
 * Description:
 *   Get the current time from the high resolution RTC clock/counter.  This
 *   interface is only supported by the high-resolution RTC/counter hardware
 *   implementation.
 *   It is used to replace the system timer.
 *
 * Input Parameters:
 *   tp - The location to return the high resolution time value.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 ****************************************************************************/

int up_rtc_gettime(struct timespec *tp)
{
  irqstate_t flags;
  uint64_t timestamp;

  flags = spin_lock_irqsave(&g_rtc_lock);
  timestamp = stm32_eth_ptp_gettime();

  if (timestamp == 0)
    {
      /* PTP timer is not initialized yet.
       * Normally we shouldn't end up here because g_rtc_enabled is false.
       */

      spin_unlock_irqrestore(&g_rtc_lock, flags);
      DEBUGASSERT(!g_rtc_enabled);
      return -EBUSY;
    }

  ptp_to_timespec(timestamp, tp);
  clock_timespec_add(tp, &g_stm32_eth_ptp_basetime, tp);
  spin_unlock_irqrestore(&g_rtc_lock, flags);

  return OK;
}

/****************************************************************************
 * Name: up_rtc_settime
 *
 * Description:
 *   Set the RTC to the provided time.  All RTC implementations must be able
 *   to set their time based on a standard timespec.
 *
 * Input Parameters:
 *   tp - the time to use
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 ****************************************************************************/

int up_rtc_settime(const struct timespec *tp)
{
  struct timespec ptptime;
  uint64_t timestamp;
  irqstate_t flags;

  flags = spin_lock_irqsave(&g_rtc_lock);
  timestamp = stm32_eth_ptp_gettime();

  if (timestamp == 0)
    {
      /* PTP timer is not initialized yet.
       * Normally we shouldn't end up here because g_rtc_enabled is false.
       */

      spin_unlock_irqrestore(&g_rtc_lock, flags);
      DEBUGASSERT(!g_rtc_enabled);
      return -EBUSY;
    }

  /* Compute new basetime to get from PTP timestamp to wall clock time.
   * We keep the PTP timer 0-based to avoid 32-bit seconds count
   * overflow issues.
   */

  ptp_to_timespec(timestamp, &ptptime);
  clock_timespec_subtract(tp, &ptptime, &g_stm32_eth_ptp_basetime);
  spin_unlock_irqrestore(&g_rtc_lock, flags);

  return OK;
}

/****************************************************************************
 * Name: up_rtc_adjtime
 *
 * Description:
 *   Adjust RTC frequency (running rate). Used by adjtime() when RTC is used
 *   as system time source.
 *
 * Input Parameters:
 *   ppb - Adjustment in parts per billion (nanoseconds per second).
 *         Zero is default rate, positive value makes clock run faster
 *         and negative value slower.
 *
 * Returned Value:
 *   Zero (OK) on success; a negated errno value on failure.
 *
 * Assumptions:
 *   Called from within a critical section.
 *
 ****************************************************************************/

int up_rtc_adjtime(long ppb)
{
  return stm32_eth_ptp_adjust(ppb);
}

#endif /* CONFIG_STM32_ETH_PTP_RTC_HIRES */

#endif /* STM32_NETHERNET > 0 */
#endif /* CONFIG_NET && CONFIG_STM32_ETHMAC */
